Revit 2027 API
AnalysisDisplayStyleColorSettingsType Enumeration
 Defines types for color settings of analysis display style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalysisDisplayStyleColorSettingsType
Public Enumeration AnalysisDisplayStyleColorSettingsType
public enum class AnalysisDisplayStyleColorSettingsType
type AnalysisDisplayStyleColorSettingsType
Members
Member name | Value | Description
GradientColor | 0 |  Intermediate and min/max color settings are used to interpolate color for values between adjacent entries.
SolidColorRanges | 1 |  Intermediate and min/max color settings define ranges in which the color is constant.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace